Билет_сервер/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Билет_сервер/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ИзменениеУчетнойПолитики</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Билет_сервер/src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВалютная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Валютный</accountingFlag>
  </resources>
</mdclass:AccountingRegister>

Билет_сервер/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Билет_сервер/src/ChartsOfAccounts/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Управленческий</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>01</code>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>01.01</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>01.02</code>
      </childItems>
      <childItems>
        <name>ТоварыВПути</name>
        <description>Товары в пути</description>
        <code>01.03</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>01.04</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>ОсновноеПроизводство</name>
        <description>Основное производство</description>
        <code>01.05</code>
      </childItems>
      <childItems>
        <name>ОбщехозяйственныеЗатраты</name>
        <description>Общехозяйственные затраты</description>
        <code>01.06</code>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыВыданные</name>
        <description>Кредиты и займы выданные</description>
        <code>01.07</code>
      </childItems>
      <childItems>
        <name>Материалы</name>
        <description>Материалы</description>
        <code>01.08</code>
      </childItems>
    </items>
    <items>
      <name>Обязательства</name>
      <description>Обязательства</description>
      <code>02</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Сотрудники</name>
        <description>Сотрудники</description>
        <code>02.01</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>02.02</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыПолученные</name>
        <description>Кредиты и займы полученные</description>
        <code>02.03</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Налоги</name>
        <description>Налоги</description>
        <code>02.04</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ПрибылиУбытки</name>
      <description>Прибыли убытки</description>
      <code>03</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Билет_сервер/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Договоры</types>
    <types>CatalogRef.Контрагенты</types>
  </type>
  <predefined>
    <items>
      <name>Договор</name>
      <description>Договор</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </items>
    <items>
      <name>Контрагент</name>
      <description>Контрагент</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Билет_сервер/src/Documents/РасходнаяНакладная/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Оперативный учет
	Движения.ОстаткиНоменклатуры.Записывать=Истина;
	Движения.ОстаткиНоменклатуры.БлокироватьДляИзменения=Истина;
	Движения.ОстаткиНоменклатуры.Очистить();
	Движения.ОстаткиНоменклатуры.Записать();

	Блокировка=Новый БлокировкаДанных;
	ЭлементБлокировки=Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
	ЭлементБлокировки.ИсточникДанных=СписокНоменклатуры;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Блокировка.Заблокировать();

	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	МИНИМУМ(РасходнаяНакладнаяСписокНоменклатуры.НомерСтроки) КАК НомерСтроки,
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество
	|ПОМЕСТИТЬ ТабЧасть
	|ИЗ
	|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
	|ГДЕ
	|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
	|	И НЕ РасходнаяНакладнаяСписокНоменклатуры.Номенклатура.Услуга
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабЧасть.НомерСтроки КАК НомерСтроки,
	|	ТабЧасть.Номенклатура КАК Номенклатура,
	|	ТабЧасть.Количество КАК Количество,
	|	ТабЧасть.Номенклатура.Представление,
	|	ОстаткиНоменклатурыОстатки.Партия,
	|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	|ИЗ
	|	ТабЧасть КАК ТабЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(&МоментИтогов, Номенклатура В
	|			(ВЫБРАТЬ
	|				Т.Номенклатура
	|			ИЗ
	|				ТабЧасть КАК Т)) КАК ОстаткиНоменклатурыОстатки
	|		ПО ТабЧасть.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОстаткиНоменклатурыОстатки.Партия.МоментВремени
	|ИТОГИ
	|	МАКСИМУМ(НомерСтроки),
	|	МАКСИМУМ(Количество),
	|	СУММА(КоличествоОстаток)
	|ПО
	|	Номенклатура";

	ЗАпрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментИтогов", МоментВремени());

	ВыборкаНоменклатура=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатура.Следующий() Цикл
		Превышение=ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.КоличествоОстаток;
		Если Превышение > 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Превышение остатка по номенклатуре " + ВыборкаНоменклатура.НоменклатураПредставление
				+ " в количестве " + Превышение;
			Сообщение.Поле = "Объект.СписокНоменклатуры[" + (ВыборкаНоменклатура.НомерСтроки - 1) + "].Количество";
			Сообщение.Сообщить();
			Отказ=Истина;
		КонецЕсли;

		Если Отказ Тогда
			Продолжить;
		КонецЕсли;

		ОсталосьСписать = ВыборкаНоменклатура.Количество;

		Выборка=ВыборкаНоменклатура.Выбрать();
		Пока Выборка.Следующий() И ОсталосьСписать <> 0 Цикл
			Списываем=Мин(Выборка.КоличествоОстаток, ОсталосьСписать);
			Движение=Движения.ОстаткиНоменклатуры.ДобавитьРасход();
			Движение.Период=Дата;
			Движение.Номенклатура=Выборка.Номенклатура;
			Движение.Партия=Выборка.Партия;
			Движение.Количество=Списываем;

			Если Списываем = Выборка.КОличествоОстаток Тогда
				Движение.Сумма=Выборка.СуммаОстаток;
			Иначе
				Движение.Сумма=Списываем / Выборка.КоличествоОстаток * Выборка.СуммаОстаток;
			КонецЕсли;

			ОсталосьСписать=ОсталосьСписать - Списываем;

		КонецЦикла;
	КонецЦикла;
	
	
	//Бухаглтерский учет
	Движения.Управленческий.Записывать=Истина;
	Движения.Управленческий.Очистить();

	ВалютаДоговора = Договор.Валюта;
	КурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(МоментВремени(), Новый Структура("Валюта",
		ВалютаДоговора)).Курс;
	Если Не ЗначениеЗаполнено(КурсВалюты) Тогда
		КурсВалюты=1;
	КонецЕсли;

	Проводка = Движения.Управленческий.Добавить();
	Проводка.Период=Дата;
	Проводка.СчетДт=ПланыСчетов.Управленческий.Покупатели;
	Проводка.СчетКт=ПланыСчетов.Управленческий.ПрибылиУбытки;
	Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент]=Контрагент;
	Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Договор]=Договор;
	Проводка.СуммаВалютнаяДт=СуммаДокумента;
	Проводка.Сумма=СуммаДокумента * КурсВалюты;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//СуммаДокумента=СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры
